# функція для створення кешованого обчислення чисел Фібоначчі
def caching_fibonacci():
    cache = {}  # словник для кешування обчислених значень

    # вкладена функція для обчислення числа Фібоначчі
    def fibonacci(n):
        if n <= 0:
            return 0  # базовий випадок для n <= 0
        if n == 1:
            return 1  # базовий випадок для n == 1

        if n in cache:  # !!!!!!!!!! перевірка, чи значення вже є в кеші
            return cache[n]  # повертаємо значення з кешу

        # обчислення числа Фібоначчі з рекурсією і збереження у кеш
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]  # повертаємо обчислене значення
    
    return fibonacci  # повертаємо вкладену функцію

# створюємо функцію для обчислення чисел Фібоначчі
fib = caching_fibonacci()
print(fib(10))  
print(fib(15))  
